Revit 2024 API
ClosestPointsPairBetweenTwoCurves Constructor (ClosestPointsPairBetweenTwoCurves)
 Creates a copy of the ClosestPointsPairBetweenTwoCurves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public ClosestPointsPairBetweenTwoCurves(
	ClosestPointsPairBetweenTwoCurves other
)
Visual Basic
Public Sub New ( _
	other As ClosestPointsPairBetweenTwoCurves _
)
Visual C++
public:
ClosestPointsPairBetweenTwoCurves(
	ClosestPointsPairBetweenTwoCurves^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ClosestPointsPairBetweenTwoCurves Class
ClosestPointsPairBetweenTwoCurves Overload
Autodesk.Revit.DB Namespace